spressomartini/ahrs_board/include/stm32f3hal/usart.h
#pragma once
#include "stm32f3hal/rcc.h"
#include <stm32f302xc.h>
#include <stdbool.h>

#define USART_CR1_M0M1          ((0x1u << 28) | (0x1u << 12))
#define USART_7DATABITS         (0x1u << 28)
#define USART_8DATABITS         (0x0u)
#define USART_9DATABITS         (0x1u << 12)

typedef struct {
    USART_TypeDef *base;
    uint32_t baud;
    uint32_t usartclk;
    uint32_t clkf;
    uint32_t stopbits;
    uint32_t wordlen;
    uint32_t oversamp;
} USART_Config;

void usart_set_baud(USART_TypeDef *base, uint32_t freq, uint32_t baud);
void usart_set_stopbits(USART_TypeDef *base, uint32_t sbits);
void usart_set_oversampling(USART_TypeDef *base, uint32_t oversamp);
void usart_set_wordlen(USART_TypeDef *base, uint32_t wordlen);

void usart_enable(USART_TypeDef *base);
void usart_disable(USART_TypeDef *base);

void usart_tx_enable(USART_TypeDef *base);
void usart_tx_disable(USART_TypeDef *base);
void usart_rx_enable(USART_TypeDef *base);
void usart_rx_disable(USART_TypeDef *base);

void usart_clock_enable(USART_TypeDef *base);

void usart_setup(USART_Config *conf);

/* STATUS */
bool usart_tdr_empty(USART_TypeDef *base);
bool usart_rdr_not_empty(USART_TypeDef *base);
